package ru.bevz.study.design_patterns;

/**
 * <h1>Краткие выводы и заметки</h1>
 *
 * <h2>Принципы проектирования:</h2>
 * <li>Выделять аспекты приложения, которые могут изменяться,
 * и определить их от тех, которые всегда остаются постоянными.</li>
 * <li>Программировать на уровне интерфейса, а не на уровне реализации.</li>
 * <li>Отдавать предпочтение композиции перед наследованием.</li>
 * <li>Стремиться к слабой связанности взаимодействующих объектов.</li>
 * <li>Классы должны быть открыты для расширения, но закрыты для изменения.</li>
 *
 */
public class SummaryNote {

}
