package ru.bevz.study.design_patterns;

/**
 * <h1>Краткие выводы и заметки</h1>
 *
 * <h2>Принципы проектирования:</h2>
 * <li>
 * Выделять аспекты приложения, которые могут изменяться,
 * и определить их от тех, которые всегда остаются постоянными.
 *
 * Программировать на уровне интерфейса, а не на уровне реализации.
 *
 * Отдавать предпочтение композиции перед наследованием.
 *
 * Стремиться к слабой связанности взаимодействующих объектов.
 * </li>
 * Слабосвязанные объекты - объекты, которые могут взаимодействовать
 * друг с другом, но при этом не обладать практически никакой информацией друг о друге.
 *
 *
 *
 */
public class SummaryNote {

}
