package ru.bevz.study.design_patterns.factory;

/**
 * <h1>Фабрика</h1>
 *
 * Паттерн Фабричный Метод определяет интерфейс создания обеъекта,
 * но позволяет субклассам выбрать класс создаваемого экземпляра.
 * Таким образом, Фабричный Метод делегирует операцию создания экземпляра субклассам.
 *
 * Паттерн Абстрактная Фабрика предоставляет интерфейс создания семейств
 * взаимосвязанных или взаимозависимых объектов без указания их конкретных классов.
 *
 */
public class FactoryApplication {
    public static void main(String[] args) {

    }
}
